Documents/бит_СправкаОСоставеСемьи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>бит_СправкаОСоставеСемьи</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВыводитьОснованиеФлаг</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДляПредъявления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокЛицевыхСчетов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ФизическиеЛица</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаРождения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РодственныеОтношения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_СтепениРодстваФизЛиц</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/бит_ФИОПроживающих.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_ФИОПроживающих</Name>
			<Comment>БИТ</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/бит_ПроживающиеПоЛС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_ПроживающиеПоЛС</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатусФизЛица</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатусФизЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтепеньРодства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтепениРодстваФизЛиц</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусПроживания</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_СтатусПроживания</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСнятияСРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВладелецКвартиры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДаНет</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаВыписки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПричиныВыписки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаПрописки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПричиныВыписки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КудаВыписан</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОткудаПрибыл</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоляПлощади</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПравоустанавливающиеДокументы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПравоустанавливающиеДокументы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусФизЛицаДляИзменения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатусФизЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПрибытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_ДоляПлощадиСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_СтрокаРодствДляФЛС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_ИгнорироватьПериодВКопииФЛС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_ДатаРегистрацииДляФЛС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_ДатаВыпискиДляФЛС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>бит_ПомещенВАрхив</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПраваСобственности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>бит_ВПечать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/бит_ПаспортныеДанныеПроживающих.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_ПаспортныеДанныеПроживающих</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДокументВид</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ДокументыУдостоверяющиеЛичность</v8:Type>
						<v8:Type>cfg:CatalogRef.УдалитьДокументыУдостоверяющиеЛичность</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументСерия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументКемВыдан</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументКодПодразделения</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаРегистрацииПоМестуЖительства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументПричинаЗамены</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ДаНет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ДаНет</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Да</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Нет</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/бит_СтатусПроживания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>бит_СтатусПроживания</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Постоянно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Временно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеПроживает</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/бит_СправкаОСоставеСемьи/Forms/ФормаДокументаУправляемая/Ext/Form/Module.bsl
#Область ПеременныеМодуля

Перем мСписокФизЛиц; // Список физлиц по выбранному лицевому счету.

// Перменные настроек ЖКХ.
Перем мПрефиксУлица ; // Хранит флаг настройки ЖКХ.
Перем мПрефиксДом ;   // Хранит флаг настройки ЖКХ.
Перем мПрефиксКорпус ; // Хранит флаг настройки ЖКХ.
Перем мПрефиксКвартира ; // Хранит флаг настройки ЖКХ.

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ЗаполнитьИзСправочникаЛицевыеСчета") Тогда
		
		Объект.ЛицевойСчет = Параметры.ЗаполнитьИзСправочникаЛицевыеСчета.ЛицевойСчет;
		
	КонецЕсли;	
	
	// Заполняем кэш значений.
	ЗаполнитьКэшЗначений(мКэшЗначений);
	
	ЭтоНовый = ?(Параметры.Ключ.Пустая(), Истина, Ложь);
	
	Если ЭтоНовый И НЕ ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда  
		
		Объект.Организация      = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("ОсновнаяОрганизация");//глЗначениеПеременной("ОсновнаяОрганизация");
		Объект.Ответственный 	= бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь");//глЗначениеПеременной("глТекущийПользователь");
		
	КонецЕсли;
	
	// БИТ ЖКХ 14.01.2020
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	//14.01.2020
	// СтандартныеПодсистемы.Печать.
//	УправлениеПечатью.ПриСозданииНаСервере(ЭтаФорма, Элементы.Печать);
	// Конец СтандартныеПодсистемы.Печать.
	Элементы.Печать.Вид = ВидГруппыФормы.Подменю;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда)
	
    УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтаФорма, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если НЕ Объект.ЛицевойСчет.Пустая() Тогда
		
		Структура = СписокПроживающих(Объект.ЛицевойСчет);
		
		КоличествоСписокФизЛиц = Структура.КоличествоФизЛиц; 
		
		ЭтаФорма.мКолЧел = КоличествоСписокФизЛиц;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ДействияКомандФормы

&НаКлиенте
Процедура ЗаполнитьПоЛС(Команда)
	Если Не ЗначениеЗаполнено(Объект.ЛицевойСчет) Тогда
		
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Лицевой счет не указан!");
		
		Возврат;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ФизЛицо) Тогда
		
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Не заполнено Физ. лицо!");
		
		Возврат;
		
	КонецЕсли;
	
	Если Объект.ФизическиеЛица.Количество() > 0 Тогда
		Ответ = Неопределено;
		
		ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьПоЛСЗавершение", ЭтотОбъект), "Табличная часть будет очищена. Продолжить?", РежимДиалогаВопрос.ДаНет);
		Возврат;      
	КонецЕсли; 
	
	
	ЗаполнитьПоЛСФрагмент();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоЛСЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Ответ = РезультатВопроса ;
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		
		Возврат;
		
	КонецЕсли;      
	
	ЗаполнитьПоЛСФрагмент();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоЛСФрагмент()
	
	Перем Структура;
	
	Структура = СписокПроживающих(Объект.ЛицевойСчет);
	
	мСписокФизЛиц = Структура.КоличествоФизЛиц;
	
	ЭтаФорма.мКолЧел = мСписокФизЛиц;
	
	ЗаполнитьТабличнуюЧасть();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоСправочнику(Команда)
	ПолучитьИзСправочникаПроживающие();
КонецПроцедуры

&НаКлиенте
// Процедура открытия формы выбора справочника - всего списка или активной строки.
//
Процедура ПолучитьИзСправочникаПроживающие(Элемент = Неопределено)
	
	ПараметрыФормы = Новый Структура("ЗакрыватьПриВыборе", Ложь);
	ПараметрыФормы.Вставить("ЛицевойСчет",Объект.ЛицевойСчет);
	Если Элемент = Неопределено Тогда
		ОткрытьФорму("Справочник.бит_Проживающие.ФормаВыбора", ПараметрыФормы, ЭтаФорма);	
	Иначе
		ОткрытьФорму("Справочник.бит_Проживающие.ФормаВыбора", ПараметрыФормы, Элемент);	
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьСправкуОбОтсутствииПрописанных(Команда)
	
	Результат = Сформировать("СправкаОбОтсутствииПрописанных");
	
	АдресТабличногоДокументаВоВременномХранилище = ПоместитьВоВременноеХранилище(Результат, АдресТабличногоДокументаВоВременномХранилище);
	
	бит_ПечатьКлиент.ОбработатьКомандуПечати("Документы"
	,"бит_СправкаОСоставеСемьи"
	,"СправкаОбОтсутствииПрописанных"
	,"Справка об отсутствии прописанных"
	
	,АдресТабличногоДокументаВоВременномХранилище
	
	,Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьСправкуОСоставеСемьи(Команда)
	
	Если Объект.Ссылка = ПредопределенноеЗначение("Документ.бит_СправкаОСоставеСемьи.ПустаяСсылка") Или Модифицированность Тогда
		
		Проведен    = Объект.Проведен;
		СтрПроведен = ?(Проведен, " и провести","");
		
		Ответ = Неопределено;
		
		ПоказатьВопрос(Новый ОписаниеОповещения("СоздатьСправкуОСоставеСемьиЗавершение1Бит", ЭтотОбъект), "Документ изменен. Для печати его необходимо записать "+ СтрПроведен +".
		|Записать" + СтрПроведен + "?",
		РежимДиалогаВопрос.ОКОтмена, , 
		КодВозвратаДиалога.Отмена,
		"Документ изменен");
		
	Иначе
		
		Результат = Сформировать("СправкаОСоставеСемьи");
		
		АдресТабличногоДокументаВоВременномХранилище = ПоместитьВоВременноеХранилище(Результат, АдресТабличногоДокументаВоВременномХранилище);
		
		бит_ПечатьКлиент.ОбработатьКомандуПечати("Документы"
		,"бит_СправкаОСоставеСемьи"
		,"СправкаОСоставеСемьи"
		,"Справка с места жительства"
		
		,АдресТабличногоДокументаВоВременномХранилище
		
		,Объект.Ссылка);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьСправкуОСоставеСемьиЗавершение1(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Ответ = РезультатВопроса;
	
	Если Ответ = КодВозвратаДиалога.ОК Тогда
		
		Результат = ЗаписатьДокументНаСервере();
		
		Если Результат Тогда
			
			Результат = Сформировать("СправкаОСоставеСемьи");
			
			АдресТабличногоДокументаВоВременномХранилище = ПоместитьВоВременноеХранилище(Результат, АдресТабличногоДокументаВоВременномХранилище);
			
			бит_ПечатьКлиент.ОбработатьКомандуПечати("Документы"
			,"бит_СправкаОСоставеСемьи"
			,"СправкаОСоставеСемьи"
			,"Справка с места жительства"
			
			,АдресТабличногоДокументаВоВременномХранилище
			
			,Объект.Ссылка);
			
		Иначе
			
			ПоказатьПредупреждение(Новый ОписаниеОповещения("СоздатьСправкуОСоставеСемьиЗавершениеБИТ", ЭтотОбъект), "Операция не выполнена!");
			
		КонецЕсли;   
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьСправкуОСоставеСемьиЗавершение(ДополнительныеПараметры) Экспорт
	
	Завершение = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	Объект.ЛицевойСчет = ПредопределенноеЗначение("Справочник.бит_ЛицевыеСчета.ПустаяСсылка");
	
	Попытка
		
		Объект.ФизЛицо = ПредопределенноеЗначение("Справочник.бит_Проживающие.ПустаяСсылка");
		
	Исключение
		
	КонецПопытки;
	
	Объект.ФизическиеЛица.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура ФизЛицоПриИзменении(Элемент)
	
	Если Объект.ФизическиеЛица.Количество() > 0 Тогда
		Ответ = Неопределено;
		
		ПоказатьВопрос(Новый ОписаниеОповещения("ФизЛицоПриИзмененииЗавершение", ЭтотОбъект), "Табличная часть будет очищена. Продолжить?", РежимДиалогаВопрос.ДаНет);
		Возврат; 
	КонецЕсли; 
	
	ФизЛицоПриИзмененииФрагмент();
КонецПроцедуры

&НаКлиенте
Процедура ФизЛицоПриИзмененииЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Ответ = РезультатВопроса ;
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли; 
	
	ФизЛицоПриИзмененииФрагмент();
	
КонецПроцедуры

&НаКлиенте
Процедура ФизЛицоПриИзмененииФрагмент()
	
	Объект.ФизическиеЛица.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура ФизЛицоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	//Мельник 240322
	СтандартнаяОбработка 	= Ложь;
	Если ЗначениеЗаполнено(Объект.ЛицевойСчет) Тогда 
		ПараметрыОтбора = Новый Структура("ЛицевойСчет", Объект.ЛицевойСчет);
		ОткрытьФорму("Справочник.бит_Проживающие.Форма.ФормаВыбораУправляемая", ПараметрыОтбора, Элемент);
	Иначе
		ОткрытьФорму("Справочник.бит_Проживающие.Форма.ФормаВыбораУправляемая", , Элемент);
	КонецЕсли;
	//Мельник 240322
КонецПроцедуры

&НаКлиенте
Процедура ЛицевойСчетПриИзменении(Элемент)
	
	Если Объект.ФизическиеЛица.Количество() > 0 Тогда
		Ответ = Неопределено;
		
		ПоказатьВопрос(Новый ОписаниеОповещения("ЛицевойСчетПриИзмененииЗавершение", ЭтотОбъект), "Табличная часть будет очищена. Продолжить?", РежимДиалогаВопрос.ДаНет);
		Возврат; 
	КонецЕсли; 
	
	ЛицевойСчетПриИзмененииФрагмент();
КонецПроцедуры

&НаКлиенте
Процедура ЛицевойСчетПриИзмененииЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Ответ = РезультатВопроса ;
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли; 
	
	ЛицевойСчетПриИзмененииФрагмент();
	
КонецПроцедуры

&НаКлиенте
Процедура ЛицевойСчетПриИзмененииФрагмент()
	
	Объект.ФизическиеЛица.Очистить();
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийТабличногоПоля

&НаКлиенте
Процедура ФизическиеЛицаФизическоеЛицоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка 	= Ложь;
	ОткрытьФорму("Справочник.бит_Проживающие.Форма.ФормаВыбораУправляемая",,Элемент);
	
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

&НаСервере
Функция Сформировать(ИмяМакета)
	Если ИмяМакета = "СправкаОСоставеСемьи" тогда
		
		//ТабДокумент = ПечатьСправкаОСоставеСемьи();
		ТабДокумент = ПечатьСправкаОСоставеСемьиБит(Истина, Ложь);
	ИначеЕсли ИмяМакета = "СправкаОСоставеСемьиБит" Тогда

		ТабДокумент = ПечатьСправкаОСоставеСемьиБит();
	ИначеЕсли ИмяМакета = "СправкаОбОтсутствииПрописанных" Тогда
		// Справка об отсутствии зарегистрированных по  ЛС выдается. 
		// ТОЛЬКО собственнику жилья.
		// Получить полный список когда-либо проживающих по ЛС.
		
		Структура = СписокПроживающих(Объект.ЛицевойСчет, Истина);
		
		НайденнаяСтрока = Структура.НайденнаяСтрока;
		
		Если НайденнаяСтрока = Ложь Тогда
			
			Если ЗначениеЗаполнено(Объект.ФизЛицо) Тогда
				Если ЗначениеЗаполнено(Объект.ФизЛицо.Пол)Тогда
					
					Если Объект.ФизЛицо.Пол = Перечисления.ПолФизическогоЛица.Женский Тогда
						Текст = Строка(Объект.ФизЛицо) + " никогда не была зарегистрирована по ЛС " + Строка(Объект.ЛицевойСчет);
					Иначе
						Текст = Строка(Объект.ФизЛицо) + " никогда не был зарегистрирован по ЛС " + Строка(Объект.ЛицевойСчет);
					КонецЕсли;
					
				Иначе
					Текст = Строка(Объект.ФизЛицо) + " никогда не был(а) зарегистрирован(а) по ЛС " + Строка(Объект.ЛицевойСчет);
				КонецЕсли;
				
			Иначе
				Текст = "Заполните реквизит ""Физ. лицо"""  ;
			КонецЕсли; 
			
			бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(Текст);
			
		ИначеЕсли НЕ Структура.ВладелецКвартиры = Перечисления.ДаНет.Да	Тогда
			
			Текст = Строка(Объект.ФизЛицо) + " никогда не был(а) зарегистрирован(а) как собственник по ЛС " + Строка(Объект.ЛицевойСчет);

			бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(Текст);
			
		Иначе
			ТабДокумент = ПечатьСправкаОСоставеСемьи(Ложь);
		КонецЕсли;
		
	КонецЕсли;
	Возврат ТабДокумент;
	
КонецФункции

&НаСервере
// Функция формирует табличный документ с печатной формой сличительной ведомости.
//
// Параметры:
//  Нет.
//
// Возвращаемое значение:
//  Табличный документ - печатная форма сличительной ведомости.
//
Функция ПечатьСправкаОСоставеСемьи(Флаг = Истина) 
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ТекущийДокумент"	, Объект.Ссылка);
	Запрос.УстановитьПараметр("Момент" 			,Объект.Дата);
	Запрос.УстановитьПараметр("ЛицевойСчет" 	,Объект.ЛицевойСчет);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СправкаОСоставеСемьи.Номер,
	|	СправкаОСоставеСемьи.Дата,
	|	СправкаОСоставеСемьи.Организация,
	|	СправкаОСоставеСемьи.ФизЛицо,
	|	ФИОФизЛицСрезПоследних.Фамилия,
	|	ФИОФизЛицСрезПоследних.Имя,
	|	ФИОФизЛицСрезПоследних.Отчество,
	|	ФИОФизЛицСрезПоследних.Фамилия + "" "" + ФИОФизЛицСрезПоследних.Имя + "" "" + ФИОФизЛицСрезПоследних.Отчество КАК ФИО,
	|	СправкаОСоставеСемьи.ДляПредъявления,
	|	бит_ПроживающиеПоЛССрезПоследних.ДатаРегистрации
	|ИЗ
	|	Документ.бит_СправкаОСоставеСемьи КАК СправкаОСоставеСемьи
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ФИОПроживающих.СрезПоследних(&Момент, ) КАК ФИОФизЛицСрезПоследних
	|		ПО СправкаОСоставеСемьи.ФизЛицо = ФИОФизЛицСрезПоследних.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(&Момент, ЛицевойСчет = &ЛицевойСчет) КАК бит_ПроживающиеПоЛССрезПоследних
	|		ПО СправкаОСоставеСемьи.ФизЛицо = бит_ПроживающиеПоЛССрезПоследних.ФизЛицо
	|ГДЕ
	|	СправкаОСоставеСемьи.Ссылка = &ТекущийДокумент";
	
	Шапка = Запрос.Выполнить().Выбрать();
	Шапка.Следующий();
	
	Запрос.УстановитьПараметр("Ссылка" ,Объект.Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ                              
	|	бит_СправкаОСоставеСемьиФизическиеЛица.ФизическоеЛицо,
	|	бит_СправкаОСоставеСемьиФизическиеЛица.РодственныеОтношения КАК РодственнаяСвязь,
	|	бит_СправкаОСоставеСемьиФизическиеЛица.ДатаРождения,
	|	ФИОФизЛицСрезПоследних.Фамилия,
	|	ФИОФизЛицСрезПоследних.Имя,
	|	ФИОФизЛицСрезПоследних.Отчество,
	|	ВЫБОР
	|		КОГДА (НЕ ФИОФизЛицСрезПоследних.Фамилия ЕСТЬ NULL )
	|			ТОГДА ФИОФизЛицСрезПоследних.Фамилия + "" "" + ФИОФизЛицСрезПоследних.Имя + "" "" + ФИОФизЛицСрезПоследних.Отчество
	|		ИНАЧЕ бит_СправкаОСоставеСемьиФизическиеЛица.ФизическоеЛицо
	|	КОНЕЦ КАК ФИО,
	|	бит_СправкаОСоставеСемьиФизическиеЛица.НомерСтроки
	|ИЗ
	|	Документ.бит_СправкаОСоставеСемьи.ФизическиеЛица КАК бит_СправкаОСоставеСемьиФизическиеЛица
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ФИОПроживающих.СрезПоследних(&Момент, ) КАК ФИОФизЛицСрезПоследних
	|		ПО бит_СправкаОСоставеСемьиФизическиеЛица.ФизическоеЛицо = ФИОФизЛицСрезПоследних.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПаспортныеДанныеПроживающих.СрезПоследних(&Момент, ) КАК ПаспортныеДанныеФизЛицСрезПоследних
	|		ПО бит_СправкаОСоставеСемьиФизическиеЛица.ФизическоеЛицо = ПаспортныеДанныеФизЛицСрезПоследних.ФизЛицо
	|ГДЕ
	|	бит_СправкаОСоставеСемьиФизическиеЛица.Ссылка = &Ссылка";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	
	ТабДокумент   = Новый ТабличныйДокумент();
	
	Если Флаг Тогда
		ТабДокумент.КлючПараметровПечати = "СправкаОСоставеСемьи";
		Макет         = Документы.бит_СправкаОСоставеСемьи.ПолучитьМакет("СправкаОСоставеСемьи");
	Иначе
		ТабДокумент.КлючПараметровПечати = "СправкаОбОтсутствииПрописанных";
		Макет         = Документы.бит_СправкаОСоставеСемьи.ПолучитьМакет("СправкаОбОтсутствииПрописанных");
	КонецЕсли;
	
	ШапкаОбласть  = Макет.ПолучитьОбласть("Шапка");
	
	ШапкаОбласть.Параметры.НомерСправки = Шапка.Номер;
	ШапкаОбласть.Параметры.ДатаВыдачи   = Формат(Шапка.Дата,"ДФ='dd.MM.yyyy ""г.""'");
	
	СтруктураДанных = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата);
	
	
	ШапкаОбласть.Параметры.Организация       = СтруктураДанных.НаименованиеДляПечатныхФорм;
	
	Если Флаг Тогда
		ШапкаОбласть.Параметры.ОрганизацияИННКПП = Строка(СтруктураДанных.ИНН)+"\"+Строка(СтруктураДанных.КПП);
		ШапкаОбласть.Параметры.Факс              = СтруктураДанных.Телефоны;
		ШапкаОбласть.Параметры.РС                = "№"+Строка(СтруктураДанных.НомерСчета)+", "+Строка(СтруктураДанных.Банк)+"\"+Строка(СтруктураДанных.КоррСчет)+"\"+Строка(СтруктураДанных.БИК);
	КонецЕсли;
	
	ШапкаОбласть.Параметры.АдресОрганизации  = СтруктураДанных.ФактическийАдрес;
	ШапкаОбласть.Параметры.Телефон           = СтруктураДанных.Телефоны;
	
	Если Шапка.ФизЛицо <> Неопределено Тогда
		
		Если Шапка.ФИО <> Null Тогда
			ФИО = Шапка.ФИО;
			
		Иначе
			ФИО = Строка(Шапка.ФизЛицо);
		КонецЕсли; 
		
		АдресПрибытия ="";
		АдресПрибытия_1 = "";
		АдресПрибытия_2 = "";
		ДлинаАдреса_1 	= 25;
		
		ФИО_склон = "";
		ИсходСклонения =  бит_ПаспортныйСтолСервер.Просклонять(Строка(ФИО),3,Шапка.ФизЛицо.Пол,ФИО_склон);
		
		Если Флаг Тогда
			ШапкаОбласть.Параметры.ДатаРегистрации = ?(ЗначениеЗаполнено(Шапка.ДатаРегистрации), Формат(Шапка.ДатаРегистрации,"ДФ='dd.MM.yyyy ""г.""'"),"");
			
			ФИО_1 = ФИО_склон;
			ФИО_2 = "";
			бит_ОбщегоНазначенияКлиентСервер.РазбитьСтроку(27,ФИО_1,ФИО_2);
			//бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(ФИО_склон, 20, ФИО_1, ФИО_2);
			ШапкаОбласть.Параметры.ФИО_1 = ФИО_1;
			ШапкаОбласть.Параметры.ФИО_2 = ФИО_2;
			
			ШапкаОбласть.Параметры.ДД   = Шапка.ФизЛицо.ДатаРождения;
			ДатаМесяц 					= Формат(Шапка.ФизЛицо.ДатаРождения,"ДФ='дд.MMMM'");
			ШапкаОбласть.Параметры.ММ 	= Сред(ДатаМесяц, 4, СтрДлина(ДатаМесяц));
			ШапкаОбласть.Параметры.ГГГГ = Шапка.ФизЛицо.ДатаРождения;
			
			АдресПрибытия = бит_ОбщегоНазначения.ПолучитьАдресИзКонтактнойИнформацииФизЛица(Шапка.ФизЛицо, "Юридический");
			Если НЕ ЗначениеЗаполнено(АдресПрибытия) Тогда
				АдресПрибытия =	Объект.ЛицевойСчет.Здание.ПочтовыйАдрес + ?(ЗначениеЗаполнено(Объект.ЛицевойСчет.Квартира), ", кв. " + Строка(Объект.ЛицевойСчет.Квартира),"");
			КонецЕсли;
		Иначе
			
			ШапкаОбласть.Параметры.ФИО = ФИО;
			
			Если ЗначениеЗаполнено(Объект.ЛицевойСчет.Здание.ПочтовыйАдрес) Тогда
				
				АдресПрибытия = Строка(Объект.ЛицевойСчет.Здание.ПочтовыйАдрес) + ?(ЗначениеЗаполнено(Объект.ЛицевойСчет.Квартира), ", кв. " + Объект.ЛицевойСчет.Квартира,"");
				
			Иначе
				ДлинаАдреса_1 = 31;
				ОбновитьНастройкиЖКХ();                                                  
				Квартира = ?(ЗначениеЗаполнено(Объект.ЛицевойСчет.Квартира),", "+ мПрефиксКвартира + Объект.ЛицевойСчет.Квартира,"");		
				Адрес = "" + мПрефиксУлица + " " + Объект.ЛицевойСчет.УлицаЛицевогоСчета + ", " + мПрефиксДом + Объект.ЛицевойСчет.Здание +?(ЗначениеЗаполнено(Объект.ЛицевойСчет.Здание.Корпус),", "+ мПрефиксКорпус + Объект.ЛицевойСчет.Здание.Корпус, "") 
				+ Строка(Квартира);
				АдресПрибытия = Адрес;

				бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Полный адрес по ЛС " + Объект.ЛицевойСчет + " можно получить, заполнив почтовый адрес у здания");
				
			КонецЕсли;
			
		КонецЕсли; 
		
		Если  ЗначениеЗаполнено(АдресПрибытия) Тогда
			
			АдресПрибытия_1 = АдресПрибытия;
			бит_ОбщегоНазначенияКлиентСервер.РазбитьСтроку(32, АдресПрибытия_1, АдресПрибытия_2);
			//бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(АдресПрибытия, ДлинаАдреса_1, АдресПрибытия_1 ,АдресПрибытия_2  );

		Иначе

			бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Для вывода в бланк адреса заполните адрес прописки в справочнике ""Проживающие"" и/или почтовый адрес в справочнике ""Список зданий""");
			
		КонецЕсли;
		
		ШапкаОбласть.Параметры.АдресПрибытия_1 =  АдресПрибытия_1;
		ШапкаОбласть.Параметры.АдресПрибытия_2 =  АдресПрибытия_2;
		
	КонецЕсли; 
	
	Если Флаг Тогда
		Если ЗначениеЗаполнено(ЭтаФорма.мКолЧел) Тогда
			ШапкаОбласть.Параметры.КолЧел          = ЭтаФорма.мКолЧел ;
		Иначе
			ШапкаОбласть.Параметры.КолЧел          = Выборка.Количество();
		КонецЕсли; 
		
	Иначе	
		Если ЭтаФорма.мКолЧел <> Неопределено Тогда
			Если ЭтаФорма.мКолЧел > 0 Тогда
				ШапкаОбласть.Параметры.Собственник = "Собственник - ";
				Если ЭтаФорма.мКолЧел = 1 Тогда
					ШапкаОбласть.Параметры.Регистрированные = "зарегистрирован "+ Строка(ЭтаФорма.мКолЧел) + " чел.";
				Иначе
					ШапкаОбласть.Параметры.Регистрированные = "зарегистрировано "+ Строка(ЭтаФорма.мКолЧел) + " чел.";
				КонецЕсли; 
			Иначе  	
				ШапкаОбласть.Параметры.Регистрированные = "никто не зарегистрирован.";
				ШапкаОбласть.Параметры.Собственник = "Собственник без регистрации - ";
				
			КонецЕсли;
		Иначе

			бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Справка выведена не полностью! Переформируйте табличную часть документа кнопкой ""Заполнить"".");
			
		КонецЕсли;
	КонецЕсли;
	
	ТабДокумент.Вывести(ШапкаОбласть);
	
	Если Флаг Тогда
		Если Выборка.Количество()>0  Тогда
			
			ШапкаСтрокОбласть  = Макет.ПолучитьОбласть("ШапкаСтрок");
			ТабДокумент.Вывести(ШапкаСтрокОбласть);
			
			ДанныеСтрока = Макет.ПолучитьОбласть("ДанныеСтрока");
			Пока Выборка.Следующий()Цикл
				ДанныеСтрока.Параметры.Заполнить(Выборка);
				ТабДокумент.Вывести(ДанныеСтрока);
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Подвал = Макет.ПолучитьОбласть("Подвал");
	Подвал.Параметры.ДляПредъявления  = Шапка.ДляПредъявления;
	
	ОтветственныеЛица = бит_ОбщегоНазначения.бит_ОтветственныеЛица(Объект.Организация, Объект.Дата);
	Руководитель = ОтветственныеЛица.Руководитель;
	Паспортист   = ОтветственныеЛица.Паспортист;
	Если ЗначениеЗаполнено(Руководитель) Тогда
		//РуководительФИО = бит_ПаспортныйСтолСервер.ПолучитьФИОФизЛица(Руководитель,Объект.Дата,Ложь,Ложь); 
		РуководительФИО = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Руководитель, "ФИО");
		РуководительФИО = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(РуководительФИО); 
	КонецЕсли;
	Если ЗначениеЗаполнено(Паспортист) Тогда
		//ПаспортистФИО = бит_ПаспортныйСтолСервер.ПолучитьФИОФизЛица(Паспортист,Объект.Дата,Ложь,Ложь); 
		ПаспортистФИО 	= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Паспортист, "ФИО");
		ПаспортистФИО = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ПаспортистФИО) 
	КонецЕсли;
	
	Если Флаг Тогда
		Подвал.Параметры.Руководитель     = ?(ЗначениеЗаполнено(РуководительФИО),"/ " + РуководительФИО + " /","");
		Подвал.Параметры.ДатаФормирования = Объект.Дата;
	КонецЕсли;
	Подвал.Параметры.Паспортист       = ?(ЗначениеЗаполнено(ПаспортистФИО),"/ " + ПаспортистФИО + " /","");
	
	ТабДокумент.Вывести(Подвал);
	
	Возврат ТабДокумент;
	
КонецФункции

&НаСервере
Процедура ОбновитьНастройкиЖКХ()
	
	ПараметрыЖКХ = Новый Структура;
	ПараметрыЖКХ.Вставить("ПрефиксУлица"                       , "");
	ПараметрыЖКХ.Вставить("ПрефиксДом"                         , "");
	ПараметрыЖКХ.Вставить("ПрефиксКорпус"                      , "");
	ПараметрыЖКХ.Вставить("ПрефиксКвартира"                    , "");
	
	бит_ОбщегоНазначения.ПолучитьНастройкиЖКХ(ТекущаяДата(), Объект.Организация, ПараметрыЖКХ);
	
	мПрефиксУлица                        = ПараметрыЖКХ.ПрефиксУлица;
	мПрефиксДом                          = ПараметрыЖКХ.ПрефиксДом;
	мПрефиксКорпус                       = ПараметрыЖКХ.ПрефиксКорпус;
	мПрефиксКвартира                     = ПараметрыЖКХ.ПрефиксКвартира;
	
КонецПроцедуры

// Процедура заполняет кэш значений, необходимый при работе на клиенте.
//
// Параметры:
//  КэшированныеЗначения - Структура.
//
&НаСервере
Процедура ЗаполнитьКэшЗначений(КэшированныеЗначения)
	
	Документ       = Метаданные.Документы.бит_СправкаОСоставеСемьи;
	ПравоИзменения = ПравоДоступа("Изменение", Документ);
	
	КэшированныеЗначения = Новый Структура;
	
	// Запишем параметр для формирования заголовка.
	КэшированныеЗначения.Вставить("ПредставлениеОбъекта", Объект.Ссылка.Метаданные().ПредставлениеОбъекта);
	КэшированныеЗначения.Вставить("ПравоИзменения"      , ПравоИзменения);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТабличнуюЧасть()
	
	Объект.ФизическиеЛица.Очистить();
	
	мСписокФизЛиц = ПолучитьИзВременногоХранилища(АдресВоВременномХранилище);
	
	СписокЗначенийФизЛиц = мСписокФизЛиц.Скопировать();
	Если  СписокЗначенийФизЛиц.Количество()>0 И ЗначениеЗаполнено(Объект.ФизЛицо) Тогда
		
		// НомерИндекса = СписокЗначенийФизЛиц.Индекс(СписокЗначенийФизЛиц.НайтиПоЗначению(Объект.ФизЛицо));.
		Если СписокЗначенийФизЛиц.Найти(Объект.ФизЛицо,"ФизическоеЛицо")<> Неопределено Тогда
			
			НомерИндекса = СписокЗначенийФизЛиц.Индекс(СписокЗначенийФизЛиц.Найти(Объект.ФизЛицо,"ФизическоеЛицо"));
			СписокЗначенийФизЛиц.Удалить(НомерИндекса);
			
		КонецЕсли;
		
	КонецЕсли;
	Если СписокЗначенийФизЛиц.Количество()>0 Тогда
		
		ЗагрузкаТабЧасти(СписокЗначенийФизЛиц, Объект.Дата);
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		
		Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.бит_Проживающие") Тогда
			
			ЗаполнитьТабличнуюЧастьНаСервере(ВыбранноеЗначение);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТабличнуюЧасть()
	
	ТабЗначений =  Объект.ФизическиеЛица.Выгрузить();	
	Возврат ТабЗначений;
	
КонецФункции

&НаСервере
Процедура ЗагрузкаТабЧасти(СписокЗначенийФизЛиц, Дата = Неопределено)
	
	Если ЗначениеЗаполнено(Дата) Тогда
		
		мТаблицаФизЛиц.Загрузить(ФормированиеДанныхТабЧасти(СписокЗначенийФизЛиц, Дата));
		Объект.ФизическиеЛица.Загрузить(мТаблицаФизЛиц.Выгрузить());
		
	КонецЕсли; 
	
КонецПроцедуры	

&НаСервере
// Функция формирует список физ лиц, когда-либо прописанных на ЛС (ВесьСписок = Ложь).
// Либо тех, кто прописан на момент даты документа (ВесьСписок = Истина).
Функция  СписокПроживающих(ЛС = Неопределено, ВесьСписок = Ложь)  
	
	Если ВесьСписок Тогда
		
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	бит_ПроживающиеПоЛССрезПоследних.ФизЛицо КАК ФизическоеЛицо,
		|	бит_ПроживающиеПоЛССрезПоследних.ВладелецКвартиры
		|ИЗ
		|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(&Дата, ЛицевойСчет = &ЛицевойСчет) КАК бит_ПроживающиеПоЛССрезПоследних";
		
	Иначе
		
		//ТекстЗапроса =
		//"ВЫБРАТЬ
		//|	бит_ПроживающиеПоЛССрезПоследних.ФизЛицо КАК ФизическоеЛицо
		//|ИЗ
		//|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(&Дата, ЛицевойСчет = &ЛицевойСчет) КАК бит_ПроживающиеПоЛССрезПоследних
		//|ГДЕ
		//|	(бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации > &Дата
		//|			ИЛИ бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации = ДАТАВРЕМЯ(1, 1, 1))";
		//
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	бит_ПроживающиеПоЛССрезПоследних.ФизЛицо КАК ФизическоеЛицо
		|ИЗ
		|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(
		|			&Дата,
		|			ЛицевойСчет = &ЛицевойСчет
		|				И СтатусПроживания <> ЗНАЧЕНИЕ(Перечисление.бит_СтатусПроживания.НеПроживает)) КАК бит_ПроживающиеПоЛССрезПоследних";
		
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	
	Если ЗначениеЗаполнено(Объект.Дата) Тогда
		
		Момент = Объект.Дата;
		
	Иначе
		
		Момент = ТекущаяДата();
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Дата"       , КонецДня(Момент));
	Запрос.УстановитьПараметр("ЛицевойСчет", ЛС);
	
	СписокФизЛиц = Запрос.Выполнить().Выгрузить();
	
	ЭтаФорма.Элементы.ФизЛицо.СписокВыбора.ЗагрузитьЗначения(СписокФизЛиц.ВыгрузитьКолонку("ФизическоеЛицо"));
	
	АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(СписокФизЛиц);
	мСписокФизЛиц = СписокФизЛиц;
	
	НайденнаяСтрока = СписокФизЛиц.Найти(Объект.ФизЛицо, "ФизическоеЛицо");
	
	Структура = Новый Структура;
	
	Если СписокФизЛиц = Неопределено Тогда
		Структура.Вставить("КоличествоФизЛиц",0);
	Иначе
		Структура.Вставить("КоличествоФизЛиц",СписокФизЛиц.Количество());
	КонецЕсли;
	
	Если НайденнаяСтрока = Неопределено Тогда
		Структура.Вставить("НайденнаяСтрока",Ложь);
		Структура.Вставить("ВладелецКвартиры",Неопределено);	
	Иначе
		Структура.Вставить("НайденнаяСтрока",Истина);
		Попытка
			Структура.Вставить("ВладелецКвартиры",НайденнаяСтрока.ВладелецКвартиры);
		Исключение
			Структура.Вставить("ВладелецКвартиры",Неопределено);
		КонецПопытки;
		
	КонецЕсли;
	
	Возврат Структура;
	
КонецФункции

&НаСервере
// Процедура формирования данных физ лиц.
// Для заполнения таб части документа.
// Параметры:
// СписокЗначенийФизЛиц - <список значений, таблица значений> - список физлиц.
//
Функция ФормированиеДанныхТабЧасти(СписокЗначенийФизЛиц, Момент)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ПроживающиеПоЛССрезПоследних.ФизЛицо КАК ФизическоеЛицо,
	|	бит_ПроживающиеПоЛССрезПоследних.ФизЛицо.ДатаРождения КАК ДатаРождения,
	|	бит_ПроживающиеПоЛССрезПоследних.СтепеньРодства КАК РодственныеОтношения,
	|	бит_ПроживающиеПоЛССрезПоследних.ОткудаПрибыл,
	|	бит_ПроживающиеПоЛССрезПоследних.ДатаПрибытия,
	|	бит_ПроживающиеПоЛССрезПоследних.КудаВыписан,
	|	ВЫБОР
	|		КОГДА бит_ПроживающиеПоЛССрезПоследних.СтепеньРодства = ЗНАЧЕНИЕ(Справочник.бит_СтепениРодстваФизЛиц.бит_ОтветственноеЛицо)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК Метка,
	|	бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации,
	|	бит_ПроживающиеПоЛССрезПоследних.СтатусПроживания,
	|	бит_ПроживающиеПоЛССрезПоследних.СтатусФизЛица,
	|	бит_ПроживающиеПоЛССрезПоследних.СтатусФизЛица.ПравоНаЛьготы КАК ПравоНаЛьготы,
	|	ВЫБОР
	|		КОГДА бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации > &Момент
	|				ИЛИ бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПрописанНаМомент
	|ИЗ
	|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(
	|			&Момент,
	|			ФизЛицо В (&ФизЛицо)
	|				И ЛицевойСчет = &ЛицевойСчет) КАК бит_ПроживающиеПоЛССрезПоследних
	|
	|УПОРЯДОЧИТЬ ПО
	|	Метка";
	
	Запрос.УстановитьПараметр("Момент"		, Момент);
	Запрос.УстановитьПараметр("ФизЛицо"		, СписокЗначенийФизЛиц);
	Запрос.УстановитьПараметр("ЛицевойСчет"	, Объект.ЛицевойСчет);
	
	Таблица = Запрос.Выполнить().Выгрузить();
	
	Возврат Таблица;
	
КонецФункции

&НаСервере
Функция ЗаписатьДокументНаСервере()
	
	ДокументОбъект = ДанныеФормыВЗначение(Объект, ПолучитьТипОбъекта(Объект.Ссылка));
	
	Попытка
		
		ДокументОбъект.Записать();
		
		Записано = Истина;
		
	Исключение
		
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(ОписаниеОшибки());
		
		Записано = Ложь;
		
	КонецПопытки;
	
	Если Записано Тогда
		
		ЗначениеВДанныеФормы(ДокументОбъект, Объект);
		
	КонецЕсли;
	
	Возврат Записано;
	
КонецФункции

// Функция получает тип объекта.
//
// Параметры:
//  ОбъектСсылка - ДокументСсылка.
//
// Возвращаемое значение:
//  ТипОбъекта - Тип.
// 
&НаСервереБезКонтекста 
Функция ПолучитьТипОбъекта(ОбъектСсылка)
	
	ИмяОбъекта = ОбъектСсылка.Метаданные().Имя;
	ТипОбъекта = Тип("ДокументОбъект." + ИмяОбъекта);
	
	Возврат ТипОбъекта;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьТабличнуюЧастьНаСервере(Знач ВыбранноеЗначение)
	
	ВременаяТабФизЛиц = ПолучитьТабличнуюЧасть();
	
	СтрокаТабличнойЧасти = ВременаяТабФизЛиц.Найти(ВыбранноеЗначение, "ФизическоеЛицо");
	
	Если СтрокаТабличнойЧасти = Неопределено Тогда
		
		Если мТаблицаФизЛиц.Количество() > 0 Тогда	
			
			Отбор = Новый Структура;
			
			Отбор.Вставить("ФизическоеЛицо", ВыбранноеЗначение);
			
			НайденныйМассив = мТаблицаФизЛиц.НайтиСтроки(Отбор);
			
			Если НайденныйМассив.Количество() > 0 Тогда
				
				НоваяСтрока = Объект.ФизическиеЛица.Добавить();
				
				ЗаполнитьЗначенияСвойств(НоваяСтрока, НайденныйМассив[0]);
				
			Иначе
				
				НоваяСтрока = Объект.ФизическиеЛица.Добавить();
				
				НоваяСтрока.ФизическоеЛицо = ВыбранноеЗначение;
				НоваяСтрока.ДатаРождения   = ВыбранноеЗначение.ДатаРождения;
				
			КонецЕсли; 
			
		Иначе
			
			НоваяСтрока = Объект.ФизическиеЛица.Добавить();
			
			НоваяСтрока.ФизическоеЛицо = ВыбранноеЗначение;
			НоваяСтрока.ДатаРождения   = ВыбранноеЗначение.ДатаРождения;
			
		КонецЕсли;	
		
	КонецЕсли;
	
КонецПроцедуры

//Добаляем новый макет справки
&НаКлиенте
Процедура СоздатьСправкуОСоставеСемьиБит(Команда)
	
	Если Объект.Ссылка = ПредопределенноеЗначение("Документ.бит_СправкаОСоставеСемьи.ПустаяСсылка") Или Модифицированность Тогда
		
		Проведен    = Объект.Проведен;
		СтрПроведен = ?(Проведен, " и провести","");
		
		Ответ = Неопределено;
		
		ПоказатьВопрос(Новый ОписаниеОповещения("СоздатьСправкуОСоставеСемьиЗавершение1Бит", ЭтотОбъект), "Документ изменен. Для печати его необходимо записать "+ СтрПроведен +".
		|Записать" + СтрПроведен + "?",
		РежимДиалогаВопрос.ОКОтмена, , 
		КодВозвратаДиалога.Отмена,
		"Документ изменен");
		
	Иначе
		
		Результат = Сформировать("СправкаОСоставеСемьиБит");
		
		АдресТабличногоДокументаВоВременномХранилище = ПоместитьВоВременноеХранилище(Результат, АдресТабличногоДокументаВоВременномХранилище);
		
		бит_ПечатьКлиент.ОбработатьКомандуПечати("Документы"
		,"бит_СправкаОСоставеСемьи"
		,"СправкаОСоставеСемьиБит"
		,"Справка о составе семьи"
		
		,АдресТабличногоДокументаВоВременномХранилище
		
		,Объект.Ссылка);
		
	КонецЕсли;
КонецПроцедуры

&НаСервере
// Функция формирует табличный документ с печатной формой сличительной ведомости.
//
// Параметры:
//  Нет.
//
// Возвращаемое значение:
//  Табличный документ - печатная форма сличительной ведомости.
//
Функция ПечатьСправкаОСоставеСемьиБит(Флаг = Истина, ЕстьТабличнаяЧасть = Истина) 
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ТекущийДокумент"	, Объект.Ссылка);
	Запрос.УстановитьПараметр("Момент" 			,Объект.Дата);
	Запрос.УстановитьПараметр("ЛицевойСчет" 	,Объект.ЛицевойСчет);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СправкаОСоставеСемьи.Номер,
	|	СправкаОСоставеСемьи.Дата,
	|	СправкаОСоставеСемьи.Организация,
	|	СправкаОСоставеСемьи.ФизЛицо,
	|	ФИОФизЛицСрезПоследних.Фамилия,
	|	ФИОФизЛицСрезПоследних.Имя,
	|	ФИОФизЛицСрезПоследних.Отчество,
	|	ФИОФизЛицСрезПоследних.Фамилия + "" "" + ФИОФизЛицСрезПоследних.Имя + "" "" + ФИОФизЛицСрезПоследних.Отчество КАК ФИО,
	|	СправкаОСоставеСемьи.ДляПредъявления,
	|	бит_ПроживающиеПоЛССрезПоследних.ДатаРегистрации
	|ИЗ
	|	Документ.бит_СправкаОСоставеСемьи КАК СправкаОСоставеСемьи
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ФИОПроживающих.СрезПоследних(&Момент, ) КАК ФИОФизЛицСрезПоследних
	|		ПО СправкаОСоставеСемьи.ФизЛицо = ФИОФизЛицСрезПоследних.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(&Момент, ЛицевойСчет = &ЛицевойСчет) КАК бит_ПроживающиеПоЛССрезПоследних
	|		ПО СправкаОСоставеСемьи.ФизЛицо = бит_ПроживающиеПоЛССрезПоследних.ФизЛицо
	|ГДЕ
	|	СправкаОСоставеСемьи.Ссылка = &ТекущийДокумент";
	
	Шапка = Запрос.Выполнить().Выбрать();
	Шапка.Следующий();
	
	Запрос.УстановитьПараметр("Ссылка" ,Объект.Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ                              
	|	бит_СправкаОСоставеСемьиФизическиеЛица.ФизическоеЛицо,
	|	бит_СправкаОСоставеСемьиФизическиеЛица.РодственныеОтношения КАК РодственнаяСвязь,
	|	бит_СправкаОСоставеСемьиФизическиеЛица.ДатаРождения,
	|	ФИОФизЛицСрезПоследних.Фамилия,
	|	ФИОФизЛицСрезПоследних.Имя,
	|	ФИОФизЛицСрезПоследних.Отчество,
	|	ВЫБОР
	|		КОГДА (НЕ ФИОФизЛицСрезПоследних.Фамилия ЕСТЬ NULL )
	|			ТОГДА ФИОФизЛицСрезПоследних.Фамилия + "" "" + ФИОФизЛицСрезПоследних.Имя + "" "" + ФИОФизЛицСрезПоследних.Отчество
	|		ИНАЧЕ бит_СправкаОСоставеСемьиФизическиеЛица.ФизическоеЛицо
	|	КОНЕЦ КАК ФИО,
	|	бит_СправкаОСоставеСемьиФизическиеЛица.НомерСтроки
	|ИЗ
	|	Документ.бит_СправкаОСоставеСемьи.ФизическиеЛица КАК бит_СправкаОСоставеСемьиФизическиеЛица
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ФИОПроживающих.СрезПоследних(&Момент, ) КАК ФИОФизЛицСрезПоследних
	|		ПО бит_СправкаОСоставеСемьиФизическиеЛица.ФизическоеЛицо = ФИОФизЛицСрезПоследних.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПаспортныеДанныеПроживающих.СрезПоследних(&Момент, ) КАК ПаспортныеДанныеФизЛицСрезПоследних
	|		ПО бит_СправкаОСоставеСемьиФизическиеЛица.ФизическоеЛицо = ПаспортныеДанныеФизЛицСрезПоследних.ФизЛицо
	|ГДЕ
	|	бит_СправкаОСоставеСемьиФизическиеЛица.Ссылка = &Ссылка";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	
	ТабДокумент   = Новый ТабличныйДокумент();
	
	Если Флаг Тогда
		ТабДокумент.КлючПараметровПечати = "СправкаОСоставеСемьи";
		Если ЕстьТабличнаяЧасть Тогда
			Макет         = Документы.бит_СправкаОСоставеСемьи.ПолучитьМакет("СправкаОСоставеСемьиБИТ");
		Иначе
			Макет         = Документы.бит_СправкаОСоставеСемьи.ПолучитьМакет("СправкаОСоставеСемьи");
		КонецЕсли;
	Иначе
		ТабДокумент.КлючПараметровПечати = "СправкаОбОтсутствииПрописанных";
		Макет         = Документы.бит_СправкаОСоставеСемьи.ПолучитьМакет("СправкаОбОтсутствииПрописанных");
	КонецЕсли;
	
	ШапкаОбласть  = Макет.ПолучитьОбласть("Шапка");
	
	ШапкаОбласть.Параметры.НомерСправки = Шапка.Номер;
	ШапкаОбласть.Параметры.ДатаВыдачи   = Формат(Шапка.Дата,"ДФ='dd.MM.yyyy ""г.""'");
	ШапкаОбласть.Параметры.НомерЛС   	= Объект.ЛицевойСчет;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бит_ЛицевыеСчета.Здание.Участок.ТелефоныПаспортиста КАК ЗданиеУчастокТелефоныПаспортиста,
		|	бит_СведенияОКвартиреСрезПоследних.лб_ПредставлениеКвартиры КАК лб_ПредставлениеКвартиры
		|ИЗ
		|	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СведенияОКвартире.СрезПоследних КАК бит_СведенияОКвартиреСрезПоследних
		|		ПО бит_ЛицевыеСчета.Квартира = бит_СведенияОКвартиреСрезПоследних.Квартира
		|ГДЕ
		|	бит_ЛицевыеСчета.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.ЛицевойСчет);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ШапкаОбласть.Параметры.ТелефонПС   	= ВыборкаДетальныеЗаписи.ЗданиеУчастокТелефоныПаспортиста;
	КонецЕсли; 
	
	СтруктураДанных = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата);
	
	
	ШапкаОбласть.Параметры.Организация       = СтруктураДанных.НаименованиеДляПечатныхФорм;
	
	Если Флаг Тогда
		ШапкаОбласть.Параметры.ОрганизацияИННКПП = Строка(СтруктураДанных.ИНН)+"\"+Строка(СтруктураДанных.КПП);
		//ШапкаОбласть.Параметры.Факс              = СтруктураДанных.Телефоны;
		ШапкаОбласть.Параметры.РС                = "№"+Строка(СтруктураДанных.НомерСчета)+", "+Строка(СтруктураДанных.Банк)+"\"+Строка(СтруктураДанных.КоррСчет)+"\"+Строка(СтруктураДанных.БИК);
	КонецЕсли;
	
	ШапкаОбласть.Параметры.АдресОрганизации  = СтруктураДанных.ФактическийАдрес;
	ШапкаОбласть.Параметры.Телефон           = СтруктураДанных.Телефоны;
	   	
	
	Если Шапка.ФизЛицо <> Неопределено Тогда
		
		Если Шапка.ФИО <> Null Тогда
			ФИО = Шапка.ФИО;
			
		Иначе
			ФИО = Строка(Шапка.ФизЛицо);
		КонецЕсли; 
		
		АдресПрибытия ="";
		АдресПрибытия_1 = "";
		АдресПрибытия_2 = "";
		ДлинаАдреса_1 	= 25;
		
		//ФИО_склон = "";
		//ИсходСклонения =  бит_ПаспортныйСтолСервер.Просклонять(Строка(ФИО),3,Шапка.ФизЛицо.Пол,ФИО_склон);
		
		Если Флаг Тогда
			Если НЕ ЕстьТабличнаяЧасть Тогда
				ШапкаОбласть.Параметры.ДатаРегистрации = ?(ЗначениеЗаполнено(Шапка.ДатаРегистрации), Формат(Шапка.ДатаРегистрации,"ДФ='dd.MM.yyyy ""г.""'"),"");
			КонецЕсли;
			ФИО_1 = ФИО;
			ФИО_2 = "";
			бит_ОбщегоНазначенияКлиентСервер.РазбитьСтроку(20,ФИО_1,ФИО_2);
			//бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(ФИО_склон, 20, ФИО_1, ФИО_2);
			ШапкаОбласть.Параметры.ФИО_1 = ФИО_1;
			ШапкаОбласть.Параметры.ФИО_2 = ФИО_2;
			
			ШапкаОбласть.Параметры.ДД   = Шапка.ФизЛицо.ДатаРождения;
			ДатаМесяц 					= Формат(Шапка.ФизЛицо.ДатаРождения,"ДФ='дд.MMMM'");
			ШапкаОбласть.Параметры.ММ 	= Сред(ДатаМесяц, 4, СтрДлина(ДатаМесяц));
			ШапкаОбласть.Параметры.ГГГГ = Шапка.ФизЛицо.ДатаРождения;
			
			АдресПрибытия = бит_ОбщегоНазначения.ПолучитьАдресИзКонтактнойИнформацииФизЛица(Шапка.ФизЛицо, "Юридический");
			Если НЕ ЗначениеЗаполнено(АдресПрибытия) Тогда
				//+бит_АнисимоваМ 20.10.2022 9556
				//АдресПрибытия =	Объект.ЛицевойСчет.Здание.ПочтовыйАдрес + ?(ЗначениеЗаполнено(Объект.ЛицевойСчет.Квартира), ", кв. " + Строка(Объект.ЛицевойСчет.Квартира),""); 
				АдресПрибытия =	Объект.ЛицевойСчет.Здание.ПочтовыйАдрес + ?(ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.лб_ПредставлениеКвартиры), ", кв. " + Строка(ВыборкаДетальныеЗаписи.лб_ПредставлениеКвартиры),""); 
				//-бит_АнисимоваМ 9556
			КонецЕсли;
		Иначе
			
			ШапкаОбласть.Параметры.ФИО = ФИО;
			
			Если ЗначениеЗаполнено(Объект.ЛицевойСчет.Здание.ПочтовыйАдрес) Тогда
				//+бит_АнисимоваМ 20.10.2022 9556
				//АдресПрибытия = Строка(Объект.ЛицевойСчет.Здание.ПочтовыйАдрес) + ?(ЗначениеЗаполнено(Объект.ЛицевойСчет.Квартира), ", кв. " + Объект.ЛицевойСчет.Квартира,""); 
				АдресПрибытия = Строка(Объект.ЛицевойСчет.Здание.ПочтовыйАдрес) + ?(ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.лб_ПредставлениеКвартиры), ", кв. " + ВыборкаДетальныеЗаписи.лб_ПредставлениеКвартиры,""); 
				//-бит_АнисимоваМ 9556
				
				
			Иначе
				ДлинаАдреса_1 = 31;
				ОбновитьНастройкиЖКХ();        
				
				//+бит_АнисимоваМ 20.10.2022 9556
				//Квартира = ?(ЗначениеЗаполнено(Объект.ЛицевойСчет.Квартира),", "+ мПрефиксКвартира +Объект.ЛицевойСчет.Квартира,"");	
				Квартира = ?(ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.лб_ПредставлениеКвартиры),", "+ мПрефиксКвартира +ВыборкаДетальныеЗаписи.лб_ПредставлениеКвартиры,"");
				//-бит_АнисимоваМ 9556
				
				Адрес = "" + мПрефиксУлица + " " + Объект.ЛицевойСчет.УлицаЛицевогоСчета + ", " + мПрефиксДом + Объект.ЛицевойСчет.Здание +?(ЗначениеЗаполнено(Объект.ЛицевойСчет.Здание.Корпус),", "+ мПрефиксКорпус + Объект.ЛицевойСчет.Здание.Корпус, "") 
				+ Строка(Квартира);
				АдресПрибытия = Адрес;

				бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Полный адрес по ЛС " + Объект.ЛицевойСчет + " можно получить, заполнив почтовый адрес у здания");
				
			КонецЕсли;
			
		КонецЕсли; 
		
		Если  ЗначениеЗаполнено(АдресПрибытия) Тогда
			
			АдресПрибытия_1 = АдресПрибытия;
			бит_ОбщегоНазначенияКлиентСервер.РазбитьСтроку(32, АдресПрибытия_1, АдресПрибытия_2);
			//бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(АдресПрибытия, ДлинаАдреса_1, АдресПрибытия_1 ,АдресПрибытия_2  );

		Иначе

			бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Для вывода в бланк адреса заполните адрес прописки в справочнике ""Проживающие"" и/или почтовый адрес в справочнике ""Список зданий""");
			
		КонецЕсли;
		
		ШапкаОбласть.Параметры.АдресПрибытия_1 =  АдресПрибытия_1;
		ШапкаОбласть.Параметры.АдресПрибытия_2 =  АдресПрибытия_2;
		
	КонецЕсли; 
	
	//Если Флаг Тогда
	//	Если ЗначениеЗаполнено(ЭтаФорма.мКолЧел) Тогда
	//		ШапкаОбласть.Параметры.КолЧел          = ЭтаФорма.мКолЧел ;
	//	Иначе
	//		ШапкаОбласть.Параметры.КолЧел          = Выборка.Количество();
	//	КонецЕсли; 
	//	
	//Иначе	
	//	Если ЭтаФорма.мКолЧел <> Неопределено Тогда
	//		Если ЭтаФорма.мКолЧел > 0 Тогда
	//			ШапкаОбласть.Параметры.Собственник = "Собственник - ";
	//			Если ЭтаФорма.мКолЧел = 1 Тогда
	//				ШапкаОбласть.Параметры.Регистрированные = "зарегистрирован "+ Строка(ЭтаФорма.мКолЧел) + " чел.";
	//			Иначе
	//				ШапкаОбласть.Параметры.Регистрированные = "зарегистрировано "+ Строка(ЭтаФорма.мКолЧел) + " чел.";
	//			КонецЕсли; 
	//		Иначе  	
	//			ШапкаОбласть.Параметры.Регистрированные = "никто не зарегистрирован.";
	//			ШапкаОбласть.Параметры.Собственник = "Собственник без регистрации - ";
	//			
	//		КонецЕсли;
	//	Иначе

	//		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Справка выведена не полностью! Переформируйте табличную часть документа кнопкой ""Заполнить"".");
	//		
	//	КонецЕсли;
	//КонецЕсли;
	
	ТабДокумент.Вывести(ШапкаОбласть);
	
	Если Флаг Тогда
		Если Выборка.Количество()>0  Тогда
			
			ШапкаСтрокОбласть  = Макет.ПолучитьОбласть("ШапкаСтрок");
			ТабДокумент.Вывести(ШапкаСтрокОбласть);
			
			ДанныеСтрока = Макет.ПолучитьОбласть("ДанныеСтрока");
			Пока Выборка.Следующий()Цикл
				ДанныеСтрока.Параметры.Заполнить(Выборка);
				ТабДокумент.Вывести(ДанныеСтрока);
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Подвал = Макет.ПолучитьОбласть("Подвал");
	Подвал.Параметры.ДляПредъявления  = Шапка.ДляПредъявления;
	
	//ОтветственныеЛица = бит_ОбщегоНазначения.бит_ОтветственныеЛица(Объект.Организация, Объект.Дата);
	//Руководитель = ОтветственныеЛица.Руководитель;
	//Паспортист   = ОтветственныеЛица.Паспортист;
	Если ЗначениеЗаполнено(Объект.Ответственный) Тогда
		Если ЗначениеЗаполнено(Объект.Ответственный.ФизическоеЛицо) Тогда
			ПаспортистФИО   = Объект.Ответственный.ФизическоеЛицо.Фамилия + " " + Объект.Ответственный.ФизическоеЛицо.Инициалы;
		Иначе	
			ПаспортистФИО   = Объект.Ответственный;
		КонецЕсли;
	КонецЕсли;
	//Если ЗначениеЗаполнено(Руководитель) Тогда
	//	//РуководительФИО = бит_ПаспортныйСтолСервер.ПолучитьФИОФизЛица(Руководитель,Объект.Дата,Ложь,Ложь); 
	//	РуководительФИО = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Руководитель, "ФИО");
	//	РуководительФИО = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(РуководительФИО); 
	//КонецЕсли;
	//Если ЗначениеЗаполнено(Паспортист) Тогда
	//	//ПаспортистФИО = бит_ПаспортныйСтолСервер.ПолучитьФИОФизЛица(Паспортист,Объект.Дата,Ложь,Ложь); 
	//	ПаспортистФИО 	= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Паспортист, "ФИО");
	//	ПаспортистФИО = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ПаспортистФИО) 
	//КонецЕсли;
	
	//Если Флаг Тогда
	//	Подвал.Параметры.Руководитель     = ?(ЗначениеЗаполнено(РуководительФИО),"/ " + РуководительФИО + " /","");
	//	Подвал.Параметры.ДатаФормирования = Объект.Дата;
	//КонецЕсли;
	Подвал.Параметры.Паспортист       = ?(ЗначениеЗаполнено(ПаспортистФИО),"/ " + ПаспортистФИО + " /","");

	ТабДокумент.Вывести(Подвал);
	Возврат ТабДокумент;
	
КонецФункции

&НаКлиенте
Процедура СоздатьСправкуОСоставеСемьиЗавершение1Бит(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Ответ = РезультатВопроса;
	
	Если Ответ = КодВозвратаДиалога.ОК Тогда
		
		Результат = ЗаписатьДокументНаСервере();
		
		Если Результат Тогда
			
			Результат = Сформировать("СправкаОСоставеСемьиБит");
			
			АдресТабличногоДокументаВоВременномХранилище = ПоместитьВоВременноеХранилище(Результат, АдресТабличногоДокументаВоВременномХранилище);
			
			бит_ПечатьКлиент.ОбработатьКомандуПечати("Документы"
			,"бит_СправкаОСоставеСемьи"
			,"СправкаОСоставеСемьиБит"
			,"Справка о составе семьи"
			
			,АдресТабличногоДокументаВоВременномХранилище
			
			,Объект.Ссылка);
			
		Иначе
			
			ПоказатьПредупреждение(Новый ОписаниеОповещения("СоздатьСправкуОСоставеСемьиЗавершениеБит", ЭтотОбъект), "Операция не выполнена!");
			
		КонецЕсли;   
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоЛСБезРег(Команда)
	
	
	Если Не ЗначениеЗаполнено(Объект.ЛицевойСчет) Тогда
		
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Лицевой счет не указан!");
		
		Возврат;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ФизЛицо) Тогда
		
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Не заполнено Физ. лицо!");
		
		Возврат;
		
	КонецЕсли;
	
	Если Объект.ФизическиеЛица.Количество() > 0 Тогда
		Ответ = Неопределено;
		
		ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьПоЛСЗавершениеБезДаты", ЭтотОбъект), "Табличная часть будет очищена. Продолжить?", РежимДиалогаВопрос.ДаНет);
		Возврат;      
	КонецЕсли; 
ФормированиеТабЧасти();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоЛСЗавершениеБезДаты(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Ответ = РезультатВопроса ;
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		
		Возврат;
		
	КонецЕсли;      
	
ФормированиеТабЧасти();

КонецПроцедуры
	

&НаСервере
Процедура ФормированиеТабЧасти()
	Объект.ФизическиеЛица.Очистить();

	
Запрос = Новый Запрос;

Запрос.УстановитьПараметр("ЛицевойСчет", Объект.ЛицевойСчет);
Запрос.УстановитьПараметр("Дата", ТекущаяДата());

Запрос.Текст = "ВЫБРАТЬ
               |	бит_ПроживающиеПоЛССрезПоследних.ФизЛицо КАК ФизическоеЛицо,
               |	бит_ПроживающиеПоЛССрезПоследних.СтепеньРодства КАК РодственныеОтношения,
               |	бит_ПроживающиеПоЛССрезПоследних.ФизЛицо.ДатаРождения КАК ДатаРождения,
               |	бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации КАК ДатаСнятияСРегистрации
               |ИЗ
               |	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(
               |			&Дата,
               |			ЛицевойСчет = &ЛицевойСчет
               |				И ДатаРегистрации <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК бит_ПроживающиеПоЛССрезПоследних";

РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если  ВыборкаДетальныеЗаписи.ФизическоеЛицо <> Объект.ФизЛицо И НЕ ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ДатаСнятияСРегистрации)  Тогда
		Стр = Объект.ФизическиеЛица.Добавить();
		Стр.ФизическоеЛицо = ВыборкаДетальныеЗаписи.ФизическоеЛицо;
		Стр.РодственныеОтношения = ВыборкаДетальныеЗаписи.РодственныеОтношения;
		Стр.ДатаРождения = ВыборкаДетальныеЗаписи.ДатаРождения;
		КонецЕсли;
	КонецЦикла;
	

КонецПроцедуры


 
#КонецОбласти
